run/3DmultiRegionDuineveldRisingBubble/baseMeshes/meshA/system/logfile.txt
/*--------------------------------*- C++ -*----------------------------------*\n| =========                 |                                                 |
| \      /  F ield         | foam-extend: Open Source CFD                    |
|  \    /   O peration     | Version:     3.2                                |
|   \  /    A nd           | Web:         http://www.foam-extend.org         |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version     2.0;
    format      ascii;
    class       dictionary;
    location    system;
object      sampleDict;
}
setFormat raw;
surfaceFormat raw;
interpolationScheme cellPoint;
fields
(
    U
    p
);
sets
(
    twoMeshes_mesh2_meshA_circler0.015p100
    {
        type cloud;
        axis xyz;
        points 
(
(0.0 0.015 0.0)
(-0.00043022138515783884 0.014970400926424073 0.0008378577814128806)
(-0.0008587448830579146 0.014881720519717168 0.0016724089209433344)
(-0.0012838793072277792 0.01473430876093033 0.0025003598265137825)
(-0.001703946846320678 0.014528747416929465 0.0033184429541547283)
(-0.002117289685670415 0.014265847744427303 0.0041234297035080015)
(-0.002522276549928457 0.01394664728832377 0.004912143159637368)
(-0.002917309140962478 0.013572405786990292 0.005681470630860393)
(-0.0033008284456088883 0.013144600200657953 0.00642837593312044)
(-0.003671320888385554 0.012664918882530225 0.00714991137241807)
(-0.004027324304882731 0.012135254915624212 0.007843229378012555)
(-0.004367433712257996 0.011557698641636839 0.00850559374048269)
(-0.004690306854061647 0.010934529411321173 0.00913439041029529)
(-0.004994669497509693 0.010268206588930328 0.009727137814264484)
(-0.005279320462298508 0.009561359846230345 0.01028149664918733)
(-0.005543136361114728 0.008816778784387096 0.010795279114004852)
(-0.005785076033131743 0.008037401924684948 0.011266457544053293)
(-0.006004184652995827 0.007226305111525727 0.011693172413330205)
(-0.0061995974990855796 0.0063866893734760895 0.012073739673194028)
(-0.006370543366173123 0.005521868290270171 0.012406657398534722)
(-0.006516347609018803 0.004635254915624212 0.012690611715186014)
(-0.006636434804887727 0.003730348307472824 0.012924481985186462)
(-0.006730331024480424 0.002810719718785871 0.013107345229425542)
(-0.006797665702315263 0.0018799985034645638 0.013238479770220513)
(-0.006838173099181116 0.0009418577929397029 0.013317368079448524)
(-0.006851693350888625 9.184850993605148e-19 0.013343698820993698)
(-0.006838173099181116 -0.000941857792939701 0.013317368079448524)
(-0.006797665702315262 -0.0018799985034645655 0.013238479770220512)
(-0.006730331024480424 -0.002810719718785872 0.013107345229425542)
(-0.006636434804887728 -0.0037303483074728194 0.012924481985186463)
(-0.006516347609018804 -0.00463525491562421 0.012690611715186016)
(-0.006370543366173123 -0.005521868290270169 0.012406657398534722)
(-0.006199597499085579 -0.00638668937347609 0.012073739673194027)
(-0.006004184652995825 -0.007226305111525731 0.011693172413330202)
(-0.005785076033131742 -0.008037401924684953 0.01126645754405329)
(-0.005543136361114728 -0.008816778784387094 0.010795279114004852)
(-0.005279320462298508 -0.009561359846230346 0.01028149664918733)
(-0.0049946694975096925 -0.01026820658893033 0.009727137814264483)
(-0.004690306854061649 -0.01093452941132117 0.009134390410295293)
(-0.004367433712257998 -0.011557698641636837 0.008505593740482691)
(-0.004027324304882732 -0.01213525491562421 0.007843229378012557)
(-0.0036713208883855566 -0.012664918882530221 0.007149911372418074)
(-0.0033008284456088905 -0.01314460020065795 0.006428375933120445)
(-0.002917309140962479 -0.01357240578699029 0.005681470630860394)
(-0.0025222765499284586 -0.013946647288323769 0.004912143159637372)
(-0.002117289685670416 -0.014265847744427303 0.004123429703508003)
(-0.0017039468463206783 -0.014528747416929465 0.0033184429541547288)
(-0.0012838793072277818 -0.014734308760930329 0.002500359826513788)
(-0.0008587448830579164 -0.014881720519717166 0.001672408920943338)
(-0.00043022138515784025 -0.014970400926424073 0.0008378577814128834)
(-8.390904330904957e-19 -0.015 1.634131804991624e-18)
(0.0004302213851578386 -0.014970400926424073 -0.0008378577814128803)
(0.0008587448830579147 -0.014881720519717168 -0.0016724089209433348)
(0.00128387930722778 -0.014734308760930329 -0.0025003598265137847)
(0.0017039468463206796 -0.014528747416929465 -0.0033184429541547314)
(0.0021172896856704168 -0.014265847744427303 -0.004123429703508006)
(0.00252227654992846 -0.013946647288323769 -0.004912143159637374)
(0.0029173091409624746 -0.013572405786990295 -0.005681470630860387)
(0.0033008284456088866 -0.013144600200657955 -0.006428375933120437)
(0.0036713208883855527 -0.012664918882530227 -0.007149911372418066)
(0.00402732430488273 -0.012135254915624213 -0.007843229378012555)
(0.004367433712257996 -0.011557698641636839 -0.00850559374048269)
(0.004690306854061648 -0.010934529411321173 -0.009134390410295292)
(0.004994669497509692 -0.010268206588930334 -0.00972713781426448)
(0.005279320462298509 -0.009561359846230343 -0.010281496649187332)
(0.005543136361114727 -0.008816778784387098 -0.01079527911400485)
(0.005785076033131745 -0.008037401924684945 -0.011266457544053296)
(0.006004184652995826 -0.0072263051115257285 -0.011693172413330203)
(0.006199597499085581 -0.006386689373476082 -0.012073739673194032)
(0.006370543366173122 -0.005521868290270179 -0.01240665739853472)
(0.006516347609018803 -0.004635254915624213 -0.012690611715186014)
(0.006636434804887727 -0.0037303483074728294 -0.012924481985186462)
(0.006730331024480425 -0.0028107197187858695 -0.013107345229425544)
(0.006797665702315262 -0.0018799985034645688 -0.013238479770220512)
(0.006838173099181116 -0.0009418577929396981 -0.013317368079448524)
(0.006851693350888625 -2.7554552980815444e-18 -0.013343698820993698)
(0.006838173099181116 0.0009418577929396925 -0.013317368079448524)
(0.006797665702315263 0.0018799985034645634 -0.013238479770220513)
(0.006730331024480425 0.002810719718785864 -0.013107345229425544)
(0.006636434804887727 0.0037303483074728238 -0.012924481985186462)
(0.006516347609018804 0.0046352549156242085 -0.012690611715186016)
(0.006370543366173123 0.0055218682902701734 -0.012406657398534722)
(0.006199597499085582 0.006386689373476077 -0.012073739673194034)
(0.006004184652995828 0.007226305111525724 -0.011693172413330207)
(0.005785076033131746 0.00803740192468494 -0.011266457544053298)
(0.005543136361114729 0.008816778784387093 -0.010795279114004854)
(0.00527932046229851 0.00956135984623034 -0.010281496649187333)
(0.004994669497509693 0.010268206588930328 -0.009727137814264484)
(0.0046903068540616495 0.010934529411321168 -0.009134390410295293)
(0.004367433712257996 0.01155769864163684 -0.00850559374048269)
(0.0040273243048827324 0.01213525491562421 -0.007843229378012559)
(0.003671320888385552 0.012664918882530228 -0.007149911372418065)
(0.0033008284456088883 0.013144600200657953 -0.00642837593312044)
(0.0029173091409624746 0.013572405786990295 -0.005681470630860386)
(0.0025222765499284625 0.013946647288323767 -0.00491214315963738)
(0.002117289685670416 0.014265847744427303 -0.004123429703508004)
(0.001703946846320682 0.014528747416929465 -0.003318442954154736)
(0.0012838793072277794 0.01473430876093033 -0.0025003598265137834)
(0.0008587448830579172 0.014881720519717166 -0.0016724089209433396)
(0.000430221385157838 0.014970400926424073 -0.0008378577814128791)
	);
    }
);
surfaces
(
    constantPlane
    {
        type            plane;    // always triangulated
basePoint       (0 0 0);
        normalVector    (0 0 1);
    }interface
     {
         type            patch;
         patchName       interface;
interpolate     true;
         
         triangulate     false;
     });

// *********************************************************************** //