run/3DmultiRegionDuineveldRisingBubble/baseMeshes/meshA/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\n| =========                 |                                                 |
| \      /  F ield         | foam-extend: Open Source CFD                    |
|  \    /   O peration     | Version:     3.2                                |
|   \  /    A nd           | Web:         http://www.foam-extend.org         |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version     2.0;
    format      ascii;
    class       dictionary;
    location    system;
object      sampleDict;
}
setFormat raw;
surfaceFormat raw;
interpolationScheme cellPoint;
fields
(
    U
    p
);
sets
(
    twoMeshes_mesh2_meshA_circler0.001p100
    {
        type cloud;
        axis xyz;
        points 
(
(0.0 0.001 0.0)
(-5.115763248812671e-05 0.0009980267284282716 3.640804829939179e-05)
(-0.00010211336917252194 0.000992114701314478 7.267241066540099e-05)
(-0.00015266611103995404 0.0009822872507286888 0.00010864996822738013)
(-0.0002026163495136232 0.0009685831611286311 0.00014419873400221473)
(-0.0002517669538223671 0.0009510565162951536 0.0001791784132520777)
(-0.0002999239489857543 0.0009297764858882515 0.00021345095716366523)
(-0.0003468972813447134 0.0009048270524660195 0.00024688110766379423)
(-0.00039250156861649754 0.0008763066800438637 0.0002793369312212236)
(-0.0004365568315138622 0.0008443279255020151 0.00031069033952802757)
(-0.0004788892040410865 0.0008090169943749475 0.00034081759500562885)
(-0.000519331619663627 0.0007705132427757893 0.00036959979914049116)
(-0.0005577244706434037 0.0007289686274214116 0.0003969233617222327)
(-0.0005939162379376246 0.0006845471059286886 0.00042268044913229146)
(-0.000627764089175225 0.0006374239897486896 0.00044676940991395387)
(-0.0006591344423509825 0.0005877852522924731 0.0004690951759442141)
(-0.0006879034930126633 0.0005358267949789966 0.000489569637624223)
(-0.0007139577028606352 0.00048175367410171517 0.0005081119916076214)
(-0.000737194247831664 0.0004257792915650727 0.0005246490596944324)
(-0.0007575214238985169 0.0003681245526846781 0.0005391155776319853)
(-0.0007748590089838615 0.00030901699437494747 0.0005514544526831038)
(-0.0007891385795601551 0.00024868988716485494 0.0005616169889450572)
(-0.0008003037806860481 0.00018738131458572474 0.0005695630795300405)
(-0.0008083105484135923 0.00012533323356430425 0.0005752613648487384)
(-0.0008131272836885107 6.279051952931353e-05 0.0005786893563722969)
(-0.0008147349770572306 6.123233995736766e-20 0.0005798335253842727)
(-0.0008131272836885107 -6.279051952931341e-05 0.0005786893563722969)
(-0.0008083105484135921 -0.00012533323356430436 0.0005752613648487383)
(-0.0008003037806860481 -0.00018738131458572482 0.0005695630795300405)
(-0.0007891385795601552 -0.0002486898871648546 0.0005616169889450573)
(-0.0007748590089838616 -0.00030901699437494736 0.0005514544526831039)
(-0.0007575214238985169 -0.00036812455268467797 0.0005391155776319853)
(-0.0007371942478316639 -0.00042577929156507275 0.0005246490596944323)
(-0.000713957702860635 -0.00048175367410171544 0.0005081119916076213)
(-0.0006879034930126632 -0.0005358267949789969 0.0004895696376242229)
(-0.0006591344423509825 -0.000587785252292473 0.0004690951759442141)
(-0.000627764089175225 -0.0006374239897486897 0.00044676940991395387)
(-0.0005939162379376245 -0.0006845471059286888 0.0004226804491322914)
(-0.0005577244706434039 -0.0007289686274214114 0.0003969233617222328)
(-0.0005193316196636271 -0.0007705132427757892 0.0003695997991404913)
(-0.00047888920404108663 -0.0008090169943749474 0.0003408175950056289)
(-0.0004365568315138625 -0.0008443279255020148 0.00031069033952802773)
(-0.00039250156861649776 -0.0008763066800438634 0.00027933693122122376)
(-0.00034689728134471357 -0.0009048270524660194 0.00024688110766379434)
(-0.0002999239489857545 -0.0009297764858882514 0.00021345095716366534)
(-0.00025176695382236723 -0.0009510565162951536 0.0001791784132520778)
(-0.00020261634951362326 -0.0009685831611286311 0.00014419873400221475)
(-0.00015266611103995436 -0.0009822872507286886 0.00010864996822738037)
(-0.00010211336917252219 -0.0009921147013144777 7.267241066540116e-05)
(-5.115763248812689e-05 -0.0009980267284282716 3.640804829939192e-05)
(-9.977625818065296e-20 -0.001 7.100912709001751e-20)
(5.115763248812669e-05 -0.0009980267284282716 -3.640804829939178e-05)
(0.00010211336917252196 -0.000992114701314478 -7.2672410665401e-05)
(0.00015266611103995417 -0.0009822872507286886 -0.00010864996822738023)
(0.0002026163495136234 -0.0009685831611286311 -0.00014419873400221486)
(0.0002517669538223674 -0.0009510565162951536 -0.0001791784132520779)
(0.0002999239489857546 -0.0009297764858882513 -0.00021345095716366545)
(0.000346897281344713 -0.0009048270524660197 -0.00024688110766379396)
(0.00039250156861649727 -0.0008763066800438638 -0.0002793369312212234)
(0.00043655683151386205 -0.0008443279255020152 -0.0003106903395280274)
(0.00047888920404108646 -0.0008090169943749476 -0.0003408175950056288)
(0.000519331619663627 -0.0007705132427757893 -0.00036959979914049116)
(0.0005577244706434038 -0.0007289686274214116 -0.00039692336172223277)
(0.0005939162379376244 -0.000684547105928689 -0.00042268044913229135)
(0.0006277640891752251 -0.0006374239897486895 -0.0004467694099139539)
(0.0006591344423509824 -0.0005877852522924732 -0.00046909517594421405)
(0.0006879034930126635 -0.0005358267949789964 -0.0004895696376242231)
(0.0007139577028606351 -0.0004817536741017153 -0.0005081119916076213)
(0.0007371942478316642 -0.00042577929156507215 -0.0005246490596944325)
(0.0007575214238985167 -0.00036812455268467857 -0.0005391155776319852)
(0.0007748590089838615 -0.0003090169943749476 -0.0005514544526831038)
(0.000789138579560155 -0.0002486898871648553 -0.0005616169889450572)
(0.0008003037806860483 -0.00018738131458572463 -0.0005695630795300406)
(0.0008083105484135921 -0.0001253332335643046 -0.0005752613648487383)
(0.0008131272836885107 -6.27905195293132e-05 -0.0005786893563722969)
(0.0008147349770572306 -1.8369701987210298e-19 -0.0005798335253842727)
(0.0008131272836885107 6.279051952931284e-05 -0.0005786893563722969)
(0.0008083105484135923 0.00012533323356430422 -0.0005752613648487384)
(0.0008003037806860483 0.00018738131458572428 -0.0005695630795300406)
(0.0007891385795601551 0.00024868988716485494 -0.0005616169889450572)
(0.0007748590089838616 0.00030901699437494725 -0.0005514544526831039)
(0.0007575214238985168 0.00036812455268467824 -0.0005391155776319852)
(0.0007371942478316642 0.0004257792915650718 -0.0005246490596944325)
(0.0007139577028606352 0.00048175367410171495 -0.0005081119916076214)
(0.0006879034930126636 0.000535826794978996 -0.0004895696376242232)
(0.0006591344423509825 0.0005877852522924729 -0.00046909517594421416)
(0.0006277640891752252 0.0006374239897486893 -0.0004467694099139541)
(0.0005939162379376246 0.0006845471059286886 -0.00042268044913229146)
(0.0005577244706434039 0.0007289686274214112 -0.0003969233617222329)
(0.000519331619663627 0.0007705132427757894 -0.00036959979914049116)
(0.00047888920404108674 0.0008090169943749474 -0.00034081759500562895)
(0.00043655683151386194 0.0008443279255020153 -0.00031069033952802735)
(0.00039250156861649754 0.0008763066800438637 -0.0002793369312212236)
(0.00034689728134471297 0.0009048270524660197 -0.00024688110766379396)
(0.00029992394898575495 0.0009297764858882512 -0.00021345095716366567)
(0.0002517669538223673 0.0009510565162951536 -0.00017917841325207785)
(0.0002026163495136237 0.000968583161128631 -0.00014419873400221508)
(0.0001526661110399541 0.0009822872507286888 -0.00010864996822738018)
(0.00010211336917252227 0.0009921147013144777 -7.267241066540122e-05)
(5.115763248812662e-05 0.0009980267284282716 -3.640804829939173e-05)
	);
    }
);
surfaces
(
    constantPlane
    {
        type            plane;    // always triangulated
basePoint       (0 0 0);
        normalVector    (0 0 1);
    }interface
     {
         type            patch;
         patchName       interface;
interpolate     true;
         
         triangulate     false;
     });

// *********************************************************************** //